project2/engineers/app/controllers/engineers_controller.rb

    def tag
@engineers=Engineer.find_tagged_with( params[:id])
---
SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN engineers ON engineers.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Engineer') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

    def index
    @engineers = Engineer.all
---
SELECT * FROM "engineers"

    def show
@engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 1)

    def edit
@engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 1)

    def create
@engineer = Engineer.new(params[:engineer])
    @engineer.project_assignments.each do |pa|
    puts "Adding project to pa #{pa.name}"
pa.project = Project.find_by_name(pa.name)
    end

    respond_to do |format|
    if @engineer.save
---
INSERT INTO "engineers" ("updated_at", "lname", "fname", "resume", "skill_level_id", "years_of_experience", "created_at") VALUES('2009-11-10 14:59:48', 'D', 'Nancy', 'this is my resume!', 1, 15, '2009-11-10 14:59:48')

    def update
@engineer = Engineer.find(params[:id])

    respond_to do |format|
if @engineer.update_attributes(params[:engineer])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 1)
UPDATE "engineers" SET "lname" = 'Doe', "fname" = 'John', "updated_at" = '2009-11-12 21:08:17' WHERE "id" = 2