project2/engineers/app/controllers/projects_controller.rb

    def tag
@projects=Project.find_tagged_with( params[:id])
---
SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN projects ON projects.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Project') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def index
    @projects = Project.all
---
SELECT * FROM "projects"

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "updated_at", "description", "organization_id", "created_at") VALUES('new project with tags', '2009-11-12 21:02:39', 'this is a test!', NULL, '2009-11-12 21:02:39')

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 6)
DELETE FROM "projects" WHERE "id" = 6