project3/engineers/app/controllers/engineers_controller.rb

    def index
 #   @engineers = Engineer.all
   @engineers = Engineer.paginate :all, :per_page => 10, :page => params[:page]
---
SELECT * FROM "engineers" LIMIT 10 OFFSET 0

    def show
    update_similar
@engineer = Engineer.find(params[:id])
    @resume = Resource.find_last_by_engineer_id(@engineer)
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2053932785)
SELECT * FROM "resources" WHERE ("resources".engineer_id = 2053932785)

    def edit
@engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2053932785)

    def update
      @engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2053932785)

    def destroy
@engineer = Engineer.find(params[:id])
    @engineer.destroy
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2053932785)
DELETE FROM "engineers" WHERE "id" = 2053932785