project3/engineers/app/controllers/project_assignments_controller.rb

  def index
    if params[:engineer_id].nil?
    @project_assignments = ProjectAssignment.paginate :all, :per_page => 10, :page => params[:page]
---
SELECT * FROM "project_assignments" LIMIT 10 OFFSET 0

  def show
    @project_assignment = ProjectAssignment.find(params[:id])
---
SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 2053932785)

  def edit
    @project_assignment = ProjectAssignment.find(params[:id])
---
SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 2053932785)

  def create
    @project_assignment = ProjectAssignment.new(params[:project_assignment])

    respond_to do |format|
      if @project_assignment.save
---
INSERT INTO "project_assignments" ("project_id", "updated_at", "engineer_id", "sdate", "project_scope_id", "edate", "created_at", "scope_id") VALUES(NULL, '2009-12-09 18:34:13', NULL, NULL, NULL, NULL, '2009-12-09 18:34:13', NULL)

  def update
    @project_assignment = ProjectAssignment.find(params[:id])
---
SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 2053932785)

  def destroy
    @project_assignment = ProjectAssignment.find(params[:id])
    @project_assignment.destroy
---
SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 2053932785)
DELETE FROM "project_assignments" WHERE "id" = 2053932785