project3/engineers/app/controllers/projects_controller.rb

SELECT * FROM "projects"
---
  def index
    @projects = Project.all

INSERT INTO "projects" ("name", "updated_at", "description", "organization_id", "created_at") VALUES('Test', '2009-12-09 18:34:11', 3, NULL, '2009-12-09 18:34:11')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 2053932785)
---
  def update
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 2053932785)
DELETE FROM "projects" WHERE "id" = 2053932785
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy