project3/engineers/app/controllers/resources_controller.rb

  def index
    @resources = Resource.all
---
SELECT * FROM "resources"

  def show
    @resource = Resource.find(params[:id])
---
SELECT * FROM "resources" WHERE ("resources"."id" = 2053932785)

  def edit
    @resource = Resource.find(params[:id])
---
SELECT * FROM "resources" WHERE ("resources"."id" = 2053932785)

  def create
    @resource = Resource.new(params[:resource])

    respond_to do |format|
      if @resource.save
---
INSERT INTO "resources" ("f_file_size", "updated_at", "engineer_id", "role", "f_content_type", "f_updated_at", "created_at", "f_file_name") VALUES(NULL, '2009-12-09 18:34:13', NULL, NULL, NULL, NULL, '2009-12-09 18:34:13', NULL)

  def update
    @resource = Resource.find(params[:id])
---
SELECT * FROM "resources" WHERE ("resources"."id" = 2053932785)

  def destroy
    @resource = Resource.find(params[:id])
    @resource.destroy
---
SELECT * FROM "resources" WHERE ("resources"."id" = 2053932785)
DELETE FROM "resources" WHERE "id" = 2053932785