project3/engineers/app/controllers/scopes_controller.rb

  def index
    @scopes = Scope.all
---
SELECT * FROM "scopes"

  def show
    @scope = Scope.find(params[:id])
---
SELECT * FROM "scopes" WHERE ("scopes"."id" = 2053932785)

  def edit
    @scope = Scope.find(params[:id])
---
SELECT * FROM "scopes" WHERE ("scopes"."id" = 2053932785)

  def create
    @scope = Scope.new(params[:scope])

    respond_to do |format|
      if @scope.save
---
INSERT INTO "scopes" ("name", "updated_at", "description", "created_at") VALUES(NULL, '2009-12-09 18:34:13', NULL, '2009-12-09 18:34:13')

  def update
    @scope = Scope.find(params[:id])
---
SELECT * FROM "scopes" WHERE ("scopes"."id" = 2053932785)

  def destroy
    @scope = Scope.find(params[:id])
    @scope.destroy
---
SELECT * FROM "scopes" WHERE ("scopes"."id" = 2053932785)
DELETE FROM "scopes" WHERE "id" = 2053932785